Revit 2026 API

# LineLoadForceVector1 Property

---

The force vector applied to the start point of the line load, oriented according to OrientTo setting.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ ForceVector1 { get; set; }
```
```vb
Public Property ForceVector1 As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ ForceVector1 {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member ForceVector1 : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The default force unit is kN/m for metric, and kip/ft for imperial. Use UnitUtils class methods to convert value from or to internal units.

#### Reference

LineLoad Class

Autodesk.Revit.DB.Structure Namespace